# Pandas

In [2]:
import numpy as np
import pandas as pd

In [119]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [120]:
df = pd.DataFrame(data, labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 1. Вывести информацию о датафрейме.

In [36]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes
None

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [10]:
df[:3]

  animal  age  visits priority
0    cat  2.5       1      yes
1    cat  3.0       3      yes
2  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [15]:
df[['animal', 'age']]

  animal  age
0    cat  2.5
1    cat  3.0
2  snake  0.5
3    dog  NaN
4    dog  5.0
5    cat  2.0
6  snake  4.5
7    cat  NaN
8    dog  7.0
9    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [41]:
df.iloc[[3, 4, 8], [0, 1]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 2.

In [45]:
df[df.visits > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

#### 6. Выберите строки, в которых отсутствует возраст.

In [57]:
df[df.age.isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [121]:
df[df.animal == 'cat'][df.age < 3]

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [65]:
df[(df.age >= 2)&(df.age <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [72]:
print('Было:', df.at['f', 'age'])
df.at['f', 'age'] = 1.5
print('Стало:', df.at['f', 'age'])

Было: 2.0
Стало: 1.5

#### 10. Рассчитать общее количество всех посещений.

In [74]:
df['visits'].sum()

19

#### 11. Расчитайте суммарный возраст животных

In [75]:
df['age'].sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [81]:
df['k'] = [np.random.randint(1, 10) for i in range(10)]
df.drop('k', axis=1, inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [96]:
df.groupby(['animal'])['animal'].count()

animal
cat      4
dog      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [103]:
df.sort_values(['age', 'visits'])

  animal  age  visits priority
c  snake  0.5       2       no
f    cat  1.5       3       no
a    cat  2.5       1      yes
j    dog  3.0       1       no
b    cat  3.0       3      yes
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [107]:
df['priority'].replace('yes', 'Yes', inplace=True)
df['priority'].replace('no', 'No', inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      Yes
b    cat  3.0       3      Yes
c  snake  0.5       2       No
d    dog  NaN       3      Yes
e    dog  5.0       2       No
f    cat  1.5       3       No
g  snake  4.5       1       No
h    cat  NaN       1      Yes
i    dog  7.0       2       No
j    dog  3.0       1       No

#### 16. В столбце «animal» измените записи «snake» на «python».

In [108]:
df['animal'].replace('snake', 'python', inplace=True)
df

   animal  age  visits priority
a     cat  2.5       1      Yes
b     cat  3.0       3      Yes
c  python  0.5       2       No
d     dog  NaN       3      Yes
e     dog  5.0       2       No
f     cat  1.5       3       No
g  python  4.5       1       No
h     cat  NaN       1      Yes
i     dog  7.0       2       No
j     dog  3.0       1       No

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [109]:
data_frame = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
data_frame.drop_duplicates(inplace=True)
data_frame

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [117]:
df = pd.DataFrame(np.random.random(size = (5, 10)), columns=list('abcdefghij'))
print(np.argmin(df.sum()))

d

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [129]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
mean = df.mean()
print(mean)
df.replace(np.nan, mean, inplace=True)
df

value    3.333333
dtype: float64

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [159]:
def get_from(s: str):
    value = s.split('_')[0]
    value = value.capitalize()
    return value


def get_to(s: str):
    value = s.split('_')[1]
    value = value.capitalize()
    return value


df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

df_from = [get_from(s) for s in df['From_To'].values]
df_to = [get_to(s) for s in df['From_To'].values]
df['From'] = df_from
df['To'] = df_to
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,NaN,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,NaN,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London